문제
상근이의 여동생 상냥이는 문방구에서 스티커 2n개를 구매했다. 스티커는 그림 (a)와 같이 2행 n열로 배치되어 있다. 상냥이는 스티커를 이용해 책상을 꾸미려고 한다.

상냥이가 구매한 스티커의 품질은 매우 좋지 않다. 스티커 한 장을 떼면, 그 스티커와 변을 공유하는 스티커는 모두 찢어져서 사용할 수 없게 된다. 
즉, 뗀 스티커의 왼쪽, 오른쪽, 위, 아래에 있는 스티커는 사용할 수 없게 된다.



모든 스티커를 붙일 수 없게된 상냥이는 각 스티커에 점수를 매기고, 점수의 합이 최대가 되게 스티커를 떼어내려고 한다. 먼저, 그림 (b)와 같이 각 스티커에 점수를 매겼다.
상냥이가 뗄 수 있는 스티커의 점수의 최댓값을 구하는 프로그램을 작성하시오. 즉, 2n개의 스티커 중에서 점수의 합이 최대가 되면서 서로 변을 공유 하지 않는 스티커 집합을 구해야 한다.

위의 그림의 경우에 점수가 50, 50, 100, 60인 스티커를 고르면, 점수는 260이 되고 이 것이 최대 점수이다. 가장 높은 점수를 가지는 두 스티커 (100과 70)은 변을 공유하기 때문에, 
동시에 뗄 수 없다.

입력
첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스의 첫째 줄에는 n (1 ≤ n ≤ 100,000)이 주어진다. 다음 두 줄에는 n개의 정수가 주어지며, 
각 정수는 그 위치에 해당하는 스티커의 점수이다. 연속하는 두 정수 사이에는 빈 칸이 하나 있다. 점수는 0보다 크거나 같고, 100보다 작거나 같은 정수이다. 

출력
각 테스트 케이스 마다, 2n개의 스티커 중에서 두 변을 공유하지 않는 스티커 점수의 최댓값을 출력한다.

예제 입력 1 
2
5
50 10 100 20 40
30 50 70 10 60
7
10 30 10 50 100 20 40
20 40 30 50 60 20 80
예제 출력 1 
260
290

알고리즘 분류
다이나믹 프로그래밍

------------------------------------------------------------------
문제 조건 상 i-1번째와 i 번째에서 같은 줄의 스티커를 뗄 수 없다.

따라서 1번 줄 기준 i 번째 열까지 진행했을 경우 최대로 뗄 수 있는 스티커의 점수는 아래의 3가지이다. 2번줄도 같은 방식이다.
1. i-1번째에 2번줄 스티커를 뗐다.
2. i-2번째에 1번줄 스티커를 뗐다.
3. i-2번째에 2번줄 스티커를 뗐다.

따라서 점화식을 구하게 된다면 아래와 같다. 
* dp[col][row] ==> row 줄의 col번째 스티커를 떼는 경우의 스티커 점수의 최대값

dp[i][0] = max(max(dp[i - 1][1], dp[i - 2][0]), dp[i - 2][1]) + arr[i][0];
dp[i][1] = max(max(dp[i - 1][0], dp[i - 2][0]), dp[i - 2][1]) + arr[i][1];

----------------------------------------------------------
#include <iostream>
#include <map>
#include <vector>
#include <queue>
#include <tuple>
#include <stack>
#include <string>
#include <algorithm>
#pragma warning(disable:4996)

#define all(x) (x).begin,(x).end
#define INF int(1e9)
#define fastio ios::sync_with_stdio(0), cin.tie(0), cout.tie(0)
#define txtcin freopen("input.txt", "r", stdin);
#define fst first  
#define snd second


using namespace std;
typedef pair<int, int> pii;

int N;
int arr[100001][2];
int dp[100001][2];
void init() {
	for (int i = 0; i < N; i++) {
		dp[0][i] = 0;
		dp[1][i] = 0;
	}
}
void solve() {
	dp[0][0] = arr[0][0];
	dp[0][1] = arr[0][1];
	dp[1][0] = dp[0][1] + arr[1][0];
	dp[1][1] = dp[0][0] + arr[1][1];
	for (int i = 2; i < N; i++) {
		dp[i][0] = max(max(dp[i - 1][1], dp[i - 2][0]), dp[i - 2][1]) + arr[i][0];
		dp[i][1] = max(max(dp[i - 1][0], dp[i - 2][0]), dp[i - 2][1]) + arr[i][1];
	}
}
int main() {
	fastio;
	int T, a;
	cin >> T;
	while (T--) {
		cin >> N;
		for (int i = 0; i < 2; i++) {
			for (int j = 0; j < N; j++) {
				cin >> a;
				arr[j][i] = a;
			}
		}
		init();
		solve();
		cout << max(dp[N - 1][0], dp[N - 1][1]) << '\n';
	}
	return 0;
}
