문제
지민이는 자신의 저택에서 MN개의 단위 정사각형으로 나누어져 있는 M*N 크기의 보드를 찾았다. 어떤 정사각형은 검은색으로 칠해져 있고, 나머지는 흰색으로 칠해져 있다. 
지민이는 이 보드를 잘라서 8*8 크기의 체스판으로 만들려고 한다.

체스판은 검은색과 흰색이 번갈아서 칠해져 있어야 한다. 구체적으로, 각 칸이 검은색과 흰색 중 하나로 색칠되어 있고, 
변을 공유하는 두 개의 사각형은 다른 색으로 칠해져 있어야 한다. 따라서 이 정의를 따르면 체스판을 색칠하는 경우는 두 가지뿐이다. 
하나는 맨 왼쪽 위 칸이 흰색인 경우, 하나는 검은색인 경우이다.

보드가 체스판처럼 칠해져 있다는 보장이 없어서, 지민이는 8*8 크기의 체스판으로 잘라낸 후에 몇 개의 정사각형을 다시 칠해야겠다고 생각했다. 
당연히 8*8 크기는 아무데서나 골라도 된다. 지민이가 다시 칠해야 하는 정사각형의 최소 개수를 구하는 프로그램을 작성하시오.

입력
첫째 줄에 N과 M이 주어진다. N과 M은 8보다 크거나 같고, 50보다 작거나 같은 자연수이다. 둘째 줄부터 N개의 줄에는 보드의 각 행의 상태가 주어진다. B는 검은색이며, W는 흰색이다.

출력
첫째 줄에 지민이가 다시 칠해야 하는 정사각형 개수의 최솟값을 출력한다.

예제 입력 1 
8 8
WBWBWBWB
BWBWBWBW
WBWBWBWB
BWBBBWBW
WBWBWBWB
BWBWBWBW
WBWBWBWB
BWBWBWBW

예제 출력 1 
1

-----------------------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <vector>
#include <queue>
#define fastio ios::sync_with_stdio(0), cin.tie(0), cout.tie(0)
using namespace std;
bool T1[8][8] = {    // 왼쪽 위가 검은색인 체스판
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1}
};
bool T2[8][8] = {   // 왼쪽 위가 하얀색인 체스판
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0},
	{0,1,0,1,0,1,0,1},
	{1,0,1,0,1,0,1,0}
};

int main() {
	int N, M;
	cin >> N >> M;
	bool table[50][50];
	char a;
	for (int i = 0; i < N; i++) {
		for (int j = 0; j < M; j++) {
			cin >> a;
			if (a == 'B') {
				table[i][j] = 1;
			}
			else {
				table[i][j] = 0;
			}
		}
	}
	int max = 999999;
	for (int i = 0; i < N - 7 ; i++) {                    //전체 보드판 탐색
		for (int j = 0; j < M - 7; j++) {
			int cnt1 = 0;
			int cnt2 = 0;
			for (int k = 0; k < 8; k++) {                       //특정 보드판 위치에서부터 체스판과 비교
				for (int z = 0; z < 8; z++) {
					if (table[i + k][j + z] != T1[z][k]) cnt1++;      //왼쪽 위가 검은색인 체스판과
					if (table[i + k][j + z] != T2[z][k]) cnt2++;      //왼쪽 위가 하얀색인 체스판과
				}
			}
			if (max > min(cnt1,cnt2)) max = min(cnt1,cnt2);       // max값 비교해서 바꿔야할 수가 더 적으면 갱신
			if (max == 0) {
				cout << 0;
				return 0;
			}
		}
	}
	cout << max;
	return 0;
}
