문제
주어진 수 N개 중에서 소수가 몇 개인지 찾아서 출력하는 프로그램을 작성하시오.

입력
첫 줄에 수의 개수 N이 주어진다. N은 100이하이다. 다음으로 N개의 수가 주어지는데 수는 1,000 이하의 자연수이다.

출력
주어진 수들 중 소수의 개수를 출력한다.

예제 입력 1 
4
1 3 5 7
예제 출력 1 
3

--------------------------------------------------------------
에라토스테네스의 체 (여러 개의 소수를 찾을 때 유용) 
가장 먼저 소수를 판별할 범위만큼 배열을 할당하여, 해당하는 값을 넣어주고, 이후에 하나씩 지워나가는 방법을 이용한다.

배열을 생성하여 초기화한다.
2부터 시작해서 특정 수의 배수에 해당하는 수를 모두 지운다.(지울 때 자기자신은 지우지 않고, 이미 지워진 수는 건너뛴다.)

--------------------------------------------------------------
#include <iostream>
#define fastio ios::sync_with_stdio(0), cin.tie(0), cout.tie(0)
using namespace std;
int arr[1001] = { 0 };
int main() {
	fastio;
	int N,a;
	int cnt = 0;
	arr[1] = 1;
	for (int i = 2; i <= 1000; i++) {
		if (arr[i] == 1) continue;
		for (int j = 2 * i; j <= 1000; j += i) arr[j] = 1;
	}
	cin >> N;
	while (N--) {
		cin >> a;
		if (arr[a] == 0) cnt++;
	}
	cout << cnt;

	return 0;
}
